Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB110.h
#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

/* Register CONFIG2 (0x157fc)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG2;
#define _CONFIG2(x) __attribute__((section("__CONFIG2.sec"),space(prog))) unsigned int _CONFIG2 = (x);

/*
** Only one invocation of CONFIG2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG2.
** Multiple options may be combined, as shown:
**
** _CONFIG2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMOD_EC           EC oscillator mode selected
**     POSCMOD_XT           XT oscillator mode selected
**     POSCMOD_HS           HS oscillator mode selected
**     POSCMOD_NONE         Primary oscillator disabled
**
**   Internal USB 3.3V Regulator Disable bit:
**     DISUVREG_ON          Regulator is enabled
**     DISUVREG_OFF         Regulator is disabled
**
**   IOLOCK One-Way Set Enable bit:
**     IOL1WAY_OFF          Unlimited Writes To RP Registers
**     IOL1WAY_ON           Write RP Registers Once
**
**   Primary Oscillator Output Function:
**     OSCIOFNC_ON          OSCO functions as port I/O (RC15)
**     OSCIOFNC_OFF         OSCO functions as CLKO (FOSC/2)
**
**   Clock Switching and Monitor:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock Switching and Fail-safe Clock Monitor are disabled
**
**   Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC oscillator with Postscaler and PLL module (FRCPLL)
**     FNOSC_PRI            Primary oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary oscillator (XT, HS, EC) with PLL module (XTPLL,HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC oscillator with Postscaler (FRCDIV)
**
**   96MHz PLL Disable:
**     PLL_96MHZ_ON         Enabled
**
**   USB 96 MHz PLL Prescaler Select bits:
**     PLLDIV_NODIV         Oscillator input used directly (4MHz input)
**     PLLDIV_DIV2          Oscillator input divided by 2 (8MHz input)
**     PLLDIV_DIV3          Oscillator input divided by 3 (12MHz input)
**     PLLDIV_DIV4          Oscillator input divided by 4 (16MHz input)
**     PLLDIV_DIV5          Oscillator input divided by 5 (20MHz input)
**     PLLDIV_DIV6          Oscillator input divided by 6 (24MHz input)
**     PLLDIV_DIV10         Oscillator input divided by 10 (40MHz input)
**     PLLDIV_DIV12         Oscillator input divided by 12 (48MHz input)
**
**   Internal External Switch Over Mode:
**     IESO_OFF             IESO mode (Two-speed start-up)disabled
**     IESO_ON              IESO mode (Two-speed start-up) enabled
**
*/

#define POSCMOD_EC           0xF7FC
#define POSCMOD_XT           0xF7FD
#define POSCMOD_HS           0xF7FE
#define POSCMOD_NONE         0xF7FF

#define DISUVREG_ON          0xF7F7
#define DISUVREG_OFF         0xF7FF

#define IOL1WAY_OFF          0xF7EF
#define IOL1WAY_ON           0xF7FF

#define OSCIOFNC_ON          0xF7DF
#define OSCIOFNC_OFF         0xF7FF

#define FCKSM_CSECME         0xF73F
#define FCKSM_CSECMD         0xF77F
#define FCKSM_CSDCMD         0xF7BF

#define FNOSC_FRC            0xF0FF
#define FNOSC_FRCPLL         0xF1FF
#define FNOSC_PRI            0xF2FF
#define FNOSC_PRIPLL         0xF3FF
#define FNOSC_SOSC           0xF4FF
#define FNOSC_LPRC           0xF5FF
#define FNOSC_FRCDIV         0xF7FF

#define PLL_96MHZ_ON         0xF7FF

#define PLLDIV_NODIV         0x87FF
#define PLLDIV_DIV2          0x97FF
#define PLLDIV_DIV3          0xA7FF
#define PLLDIV_DIV4          0xB7FF
#define PLLDIV_DIV5          0xC7FF
#define PLLDIV_DIV6          0xD7FF
#define PLLDIV_DIV10         0xE7FF
#define PLLDIV_DIV12         0xF7FF

#define IESO_OFF             0x77FF
#define IESO_ON              0xF7FF

/* Register CONFIG1 (0x157fe)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG1;
#define _CONFIG1(x) __attribute__((section("__CONFIG1.sec"),space(prog))) unsigned int _CONFIG1 = (x);

/*
** Only one invocation of CONFIG1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG1.
** Multiple options may be combined, as shown:
**
** _CONFIG1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1,024
**     WDTPS_PS2048         1:2,048
**     WDTPS_PS4096         1:4,096
**     WDTPS_PS8192         1:8,192
**     WDTPS_PS16384        1:16,384
**     WDTPS_PS32768        1:32,768
**
**   WDT Prescaler:
**     FWPSA_PR32           Prescaler ratio of 1:32
**     FWPSA_PR128          Prescaler ratio of 1:128
**
**   Watchdog Timer Window:
**     WINDIS_ON            Windowed Watchdog Timer enabled; FWDTEN must be 1
**     WINDIS_OFF           Standard Watchdog Timer enabled,(Windowed-mode is disabled)
**
**   Watchdog Timer Enable:
**     FWDTEN_OFF           Watchdog Timer is disabled
**     FWDTEN_ON            Watchdog Timer is enabled
**
**   Comm Channel Select:
**     ICS_PGx3             Emulator functions are shared with PGEC3/PGED3
**     ICS_PGx2             Emulator functions are shared with PGEC2/PGED2
**     ICS_PGx1             Emulator functions are shared with PGEC1/PGED1
**
**   Set Clip On Emulation Mode:
**     COE_ON               Enabled
**     COE_OFF              Disabled
**
**   Background Debug:
**     BKBUG_ON             Device resets into Debug mode
**     BKBUG_OFF            Device resets into Operational mode
**
**   General Code Segment Write Protect:
**     GWRP_ON              Writes to program memory are disabled
**     GWRP_OFF             Writes to program memory are allowed
**
**   General Code Segment Code Protect:
**     GCP_ON               Code protection is enabled for the entire program memory space
**     GCP_OFF              Code protection is disabled
**
**   JTAG Port Enable:
**     JTAGEN_OFF           JTAG port is disabled
**     JTAGEN_ON            JTAG port is enabled
**
*/

#define WDTPS_PS1            0x7FF0
#define WDTPS_PS2            0x7FF1
#define WDTPS_PS4            0x7FF2
#define WDTPS_PS8            0x7FF3
#define WDTPS_PS16           0x7FF4
#define WDTPS_PS32           0x7FF5
#define WDTPS_PS64           0x7FF6
#define WDTPS_PS128          0x7FF7
#define WDTPS_PS256          0x7FF8
#define WDTPS_PS512          0x7FF9
#define WDTPS_PS1024         0x7FFA
#define WDTPS_PS2048         0x7FFB
#define WDTPS_PS4096         0x7FFC
#define WDTPS_PS8192         0x7FFD
#define WDTPS_PS16384        0x7FFE
#define WDTPS_PS32768        0x7FFF

#define FWPSA_PR32           0x7FEF
#define FWPSA_PR128          0x7FFF

#define WINDIS_ON            0x7FBF
#define WINDIS_OFF           0x7FFF

#define FWDTEN_OFF           0x7F7F
#define FWDTEN_ON            0x7FFF

#define ICS_PGx3             0x7DFF
#define ICS_PGx2             0x7EFF
#define ICS_PGx1             0x7FFF

#define COE_ON               0x7FFF
#define COE_OFF              0x7FFF

#define BKBUG_ON             0x7FFF
#define BKBUG_OFF            0x7FFF

#define GWRP_ON              0x6FFF
#define GWRP_OFF             0x7FFF

#define GCP_ON               0x5FFF
#define GCP_OFF              0x7FFF

#define JTAGEN_OFF           0x3FFF
#define JTAGEN_ON            0x7FFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x155f8

#define __CONFIG3_BASE 0x157fa
#define __CONFIG3_LENGTH 0x2

#define __CONFIG2_BASE 0x157fc
#define __CONFIG2_LENGTH 0x2

#define __CONFIG1_BASE 0x157fe
#define __CONFIG1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000


#endif
